In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('data/grades.csv')
df.head(2)

,student_id,assignment1_grade,assignment1_submission,assignment2_grade,assignment2_submission,assignment3_grade,assignment3_submission,assignment4_grade,assignment4_submission,assignment5_grade,assignment5_submission,assignment6_grade,assignment6_submission
0,B73F2C11-70F0-E37D-8B10-1D20AFED50B1,92.733946,2015-11-02 06:55:34.282000000,83.030552,2015-11-09 02:22:58.938000000,67.164441,2015-11-12 08:58:33.998000000,53.011553,2015-11-16 01:21:24.663000000,47.710398,2015-11-20 13:24:59.692000000,38.168318,2015-11-22 18:31:15.934000000
1,98A0FAE0-A19A-13D2-4BB5-CFBFD94031D1,86.790821,2015-11-29 14:57:44.429000000,86.290821,2015-12-06 17:41:18.449000000,69.772657,2015-12-10 08:54:55.904000000,55.098125,2015-12-13 17:32:30.941000000,49.588313,2015-12-19 23:26:39.285000000,44.629482,2015-12-21 17:07:24.275000000

In [5]:
df1 = df.iloc[:, [0,1,3,5]]
df1.head(2)

,student_id,assignment1_grade,assignment2_grade,assignment3_grade
0,B73F2C11-70F0-E37D-8B10-1D20AFED50B1,92.733946,83.030552,67.164441
1,98A0FAE0-A19A-13D2-4BB5-CFBFD94031D1,86.790821,86.290821,69.772657

In [8]:
#row can be any variable name
df1['final'] = df1.apply(lambda col: (row[1] + row[2] + (2*row[3]))/(4*100), axis =1)
df1.head(2)

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,student_id,assignment1_grade,assignment2_grade,assignment3_grade,final
0,B73F2C11-70F0-E37D-8B10-1D20AFED50B1,92.733946,83.030552,67.164441,0.775233
1,98A0FAE0-A19A-13D2-4BB5-CFBFD94031D1,86.790821,86.290821,69.772657,0.781567

In [21]:
#evaluate how many students are 1%
num_students = int(len(df)* 0.01)
num_students

23

In [22]:
indicies = df1.final.argsort().head()
indicies.head()

0    1424
1      15
2     226
3    2237
4     339
Name: final, dtype: int64

In [23]:
df1.final[1424]

0.13341549732972496

In [35]:
df1.iloc[indicies[-num_students:]][::-1]

,student_id,assignment1_grade,assignment2_grade,assignment3_grade,final
339,6D2AB78F-44F4-2E8B-5C5E-B79119BC7EAC,18.962538,17.066284,17.066284,0.175403
2237,247B105C-2067-A7AA-2CBE-B65278128C96,19.524002,15.259202,14.453282,0.159224
226,DDE0526B-7DA4-80E8-C2A6-D097F3826029,18.018145,16.216331,14.594698,0.158560
15,24827B50-2FC2-E4B0-E2A0-1989E17749B3,14.959603,14.459603,12.307682,0.135086
1424,EFDA9F93-D0C3-864F-B0F6-2E9AA3E05E31,14.423297,12.980967,12.980967,0.133415